# GetStringerGeometries Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLegacyStairOrRamp..::..GetStringerGeometries Method
IFCLegacyStairOrRamp Class See Also
---
Gets the geometries of stringers.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<GeometryObject> GetStringerGeometries()
```

Visual Basic
---
```text
Public Function GetStringerGeometries As IList(Of GeometryObject)
```

Visual C++
---
```text
public:
IList<GeometryObject^>^ GetStringerGeometries()
```

# ### Return Value
The geometries of stringers.
# See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace